### Terraform CI Summary

**Format & Style:** ✅ `success`  
**Initialization:** ✅ `success`  
**Validation:** ✅ `success`  
**Plan:** ✅ `success`  

<details>
<summary>Show Terraform Plan</summary>

```
[0m[1mmodule.kube-hetzner.hcloud_placement_group.control_plane[0]: Refreshing state... [id=1126591][0m
[0m[1mmodule.kube-hetzner.hcloud_ssh_key.k3s[0]: Refreshing state... [id=101165330][0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.hcloud_firewall.k3s: Refreshing state... [id=2381780][0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.hcloud_network.k3s[0]: Refreshing state... [id=11372486][0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[2]: Refreshing state... [id=11372486-10.253.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[1]: Refreshing state... [id=11372486-10.254.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[0]: Refreshing state... [id=11372486-10.255.0.0/16][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.identity_file: Refreshing state... [id=jcmqn8grt1jxb0tpndjs][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.server: Refreshing state... [id=sqi][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_server.server: Refreshing state... [id=107330532][0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Read complete after 1s [id=229419124][0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Read complete after 1s [id=237686054][0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Read complete after 1s [id=203405526][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # module.kube-hetzner.hcloud_firewall.k3s[0m has been deleted
[0m  [31m-[0m[0m resource "hcloud_firewall" "k3s" {
      [31m-[0m[0m id     = "2381780" [90m-> null[0m[0m
        name   = "kube-baphomet"
        [90m# (1 unchanged attribute hidden)[0m[0m

        [90m# (11 unchanged blocks hidden)[0m[0m
    }

[1m  # module.kube-hetzner.hcloud_network.k3s[0][0m has been deleted
[0m  [31m-[0m[0m resource "hcloud_network" "k3s" {
      [31m-[0m[0m id                       = "11372486" [90m-> null[0m[0m
        name                     = "kube-baphomet"
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[1m  # module.kube-hetzner.hcloud_ssh_key.k3s[0][0m has been deleted
[0m  [31m-[0m[0m resource "hcloud_ssh_key" "k3s" {
      [31m-[0m[0m id          = "101165330" [90m-> null[0m[0m
        name        = "kube-baphomet"
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_server.server[0m has been deleted
[0m  [31m-[0m[0m resource "hcloud_server" "server" {
      [31m-[0m[0m id                         = "107330532" [90m-> null[0m[0m
      [31m-[0m[0m ipv4_address               = "91.98.29.19" [90m-> null[0m[0m
      [31m-[0m[0m ipv6_address               = "2a01:4f8:c0c:7460::1" [90m-> null[0m[0m
      [31m-[0m[0m name                       = "kube-baphomet-control-plane-1-sqi" [90m-> null[0m[0m
        [90m# (20 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m network {
          [31m-[0m[0m alias_ips   = [] [90m-> null[0m[0m
          [31m-[0m[0m ip          = "10.254.0.101" [90m-> null[0m[0m
          [31m-[0m[0m mac_address = "86:00:00:a8:d1:47" [90m-> null[0m[0m
          [31m-[0m[0m network_id  = 11372486 [90m-> null[0m[0m
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # aws_route53_record.api_ipv4[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "api_ipv4" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "api.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.api_ipv6[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "api_ipv6" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "api.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.lb_ipv4[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "lb_ipv4" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "lb.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.lb_ipv6[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "lb_ipv6" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "lb.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.rancher_ipv4[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "rancher_ipv4" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "rancher.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.rancher_ipv6[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "rancher_ipv6" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "rancher.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # module.kube-hetzner.data.hcloud_network.k3s[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "hcloud_network" "k3s" {
      [32m+[0m[0m delete_protection        = (known after apply)
      [32m+[0m[0m expose_routes_to_vswitch = (known after apply)
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ip_range                 = (known after apply)
      [32m+[0m[0m labels                   = (known after apply)
      [32m+[0m[0m name                     = (known after apply)
    }

[1m  # module.kube-hetzner.hcloud_firewall.k3s[0m will be created
[0m  [32m+[0m[0m resource "hcloud_firewall" "k3s" {
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m labels = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
        }
      [32m+[0m[0m name   = "kube-baphomet"

      [32m+[0m[0m rule {
          [32m+[0m[0m description     = "Allow Incoming ICMP Ping Requests"
          [32m+[0m[0m destination_ips = []
          [32m+[0m[0m direction       = "in"
          [32m+[0m[0m protocol        = "icmp"
          [32m+[0m[0m source_ips      = [
              [32m+[0m[0m "0.0.0.0/0",
              [32m+[0m[0m "::/0",
            ]
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
      [32m+[0m[0m rule {
          [32m+[0m[0m description     = "Allow Incoming Requests to Kube API Server"
          [32m+[0m[0m destination_ips = []
          [32m+[0m[0m direction       = "in"
          [32m+[0m[0m port            = "6443"
          [32m+[0m[0m protocol        = "tcp"
          [32m+[0m[0m source_ips      = [
              [32m+[0m[0m "0.0.0.0/0",
              [32m+[0m[0m "::/0",
            ]
        }
      [32m+[0m[0m rule {
          [32m+[0m[0m description     = "Allow Incoming SSH Traffic"
          [32m+[0m[0m destination_ips = []
          [32m+[0m[0m direction       = "in"
          [32m+[0m[0m port            = "22"
          [32m+[0m[0m protocol        = "tcp"
          [32m+[0m[0m source_ips      = [
              [32m+[0m[0m "0.0.0.0/0",
              [32m+[0m[0m "::/0",
            ]
        }
    }

[1m  # module.kube-hetzner.hcloud_load_balancer.cluster[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_load_balancer" "cluster" {
      [32m+[0m[0m delete_protection  = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m ipv4               = (known after apply)
      [32m+[0m[0m ipv6               = (known after apply)
      [32m+[0m[0m labels             = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
        }
      [32m+[0m[0m load_balancer_type = "lb11"
      [32m+[0m[0m location           = "fsn1"
      [32m+[0m[0m name               = "kube-baphomet-nginx"
      [32m+[0m[0m network_id         = (known after apply)
      [32m+[0m[0m network_ip         = (known after apply)
      [32m+[0m[0m network_zone       = (known after apply)

      [32m+[0m[0m algorithm {
          [32m+[0m[0m type = "round_robin"
        }

      [32m+[0m[0m target (known after apply)
    }

[1m  # module.kube-hetzner.hcloud_load_balancer_network.cluster[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_load_balancer_network" "cluster" {
      [32m+[0m[0m enable_public_interface = true
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ip                      = "10.0.0.254"
      [32m+[0m[0m load_balancer_id        = (known after apply)
      [32m+[0m[0m subnet_id               = (known after apply)
    }

[1m  # module.kube-hetzner.hcloud_load_balancer_target.cluster[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_load_balancer_target" "cluster" {
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m label_selector   = "cluster=kube-baphomet,engine=k3s,provisioner=terraform,role in (control_plane_node,agent_node)"
      [32m+[0m[0m load_balancer_id = (known after apply)
      [32m+[0m[0m type             = "label_selector"
      [32m+[0m[0m use_private_ip   = true
    }

[1m  # module.kube-hetzner.hcloud_network.k3s[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_network" "k3s" {
      [32m+[0m[0m delete_protection        = false
      [32m+[0m[0m expose_routes_to_vswitch = false
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ip_range                 = "10.0.0.0/8"
      [32m+[0m[0m labels                   = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
        }
      [32m+[0m[0m name                     = "kube-baphomet"
    }

[1m  # module.kube-hetzner.hcloud_network_subnet.agent[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_network_subnet" "agent" {
      [32m+[0m[0m gateway      = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_range     = "10.0.0.0/16"
      [32m+[0m[0m network_id   = (known after apply)
      [32m+[0m[0m network_zone = "eu-central"
      [32m+[0m[0m type         = "cloud"
    }

[1m  # module.kube-hetzner.hcloud_network_subnet.agent[1][0m will be created
[0m  [32m+[0m[0m resource "hcloud_network_subnet" "agent" {
      [32m+[0m[0m gateway      = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_range     = "10.1.0.0/16"
      [32m+[0m[0m network_id   = (known after apply)
      [32m+[0m[0m network_zone = "eu-central"
      [32m+[0m[0m type         = "cloud"
    }

[1m  # module.kube-hetzner.hcloud_network_subnet.agent[2][0m will be created
[0m  [32m+[0m[0m resource "hcloud_network_subnet" "agent" {
      [32m+[0m[0m gateway      = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_range     = "10.2.0.0/16"
      [32m+[0m[0m network_id   = (known after apply)
      [32m+[0m[0m network_zone = "eu-central"
      [32m+[0m[0m type         = "cloud"
    }

[1m  # module.kube-hetzner.hcloud_network_subnet.control_plane[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_network_subnet" "control_plane" {
      [32m+[0m[0m gateway      = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_range     = "10.255.0.0/16"
      [32m+[0m[0m network_id   = (known after apply)
      [32m+[0m[0m network_zone = "eu-central"
      [32m+[0m[0m type         = "cloud"
    }

[1m  # module.kube-hetzner.hcloud_network_subnet.control_plane[1][0m will be created
[0m  [32m+[0m[0m resource "hcloud_network_subnet" "control_plane" {
      [32m+[0m[0m gateway      = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_range     = "10.254.0.0/16"
      [32m+[0m[0m network_id   = (known after apply)
      [32m+[0m[0m network_zone = "eu-central"
      [32m+[0m[0m type         = "cloud"
    }

[1m  # module.kube-hetzner.hcloud_network_subnet.control_plane[2][0m will be created
[0m  [32m+[0m[0m resource "hcloud_network_subnet" "control_plane" {
      [32m+[0m[0m gateway      = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m ip_range     = "10.253.0.0/16"
      [32m+[0m[0m network_id   = (known after apply)
      [32m+[0m[0m network_zone = "eu-central"
      [32m+[0m[0m type         = "cloud"
    }

[1m  # module.kube-hetzner.hcloud_placement_group.agent[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_placement_group" "agent" {
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m labels  = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
        }
      [32m+[0m[0m name    = "kube-baphomet-agent-1"
      [32m+[0m[0m servers = (known after apply)
      [32m+[0m[0m type    = "spread"
    }

[1m  # module.kube-hetzner.hcloud_placement_group.control_plane[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_placement_group" "control_plane" {
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m labels  = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
        }
      [32m+[0m[0m name    = "kube-baphomet-control-plane-1"
      [32m+[0m[0m servers = (known after apply)
      [32m+[0m[0m type    = "spread"
    }

[1m  # module.kube-hetzner.hcloud_ssh_key.k3s[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_ssh_key" "k3s" {
      [32m+[0m[0m fingerprint = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m labels      = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
        }
      [32m+[0m[0m name        = "kube-baphomet"
      [32m+[0m[0m public_key  = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDM6+/y/tv38oxmx8PPUPCljLm5o/Q8ROFOtddjwGaZq sandro@sandros-MBP.telekom.ip"
    }

[1m  # module.kube-hetzner.local_file.kustomization_backup[0][0m will be created
[0m  [32m+[0m[0m resource "local_file" "kustomization_backup" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0777"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kustomization_backup.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.local_sensitive_file.kubeconfig[0][0m will be created
[0m  [32m+[0m[0m resource "local_sensitive_file" "kubeconfig" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0700"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kubeconfig.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.null_resource.agent_config["0-0-worker-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agent_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
          [32m+[0m[0m "config"   = (sensitive value)
        }
    }

[1m  # module.kube-hetzner.null_resource.agent_config["1-0-worker-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agent_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
          [32m+[0m[0m "config"   = (sensitive value)
        }
    }

[1m  # module.kube-hetzner.null_resource.agent_config["2-0-worker-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agent_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
          [32m+[0m[0m "config"   = (sensitive value)
        }
    }

[1m  # module.kube-hetzner.null_resource.agents["0-0-worker-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agents" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.agents["1-0-worker-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agents" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.agents["2-0-worker-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agents" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.authentication_config["0-0-control-plane-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "authentication_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
          [32m+[0m[0m "control_plane_id"      = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.authentication_config["1-0-control-plane-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "authentication_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
          [32m+[0m[0m "control_plane_id"      = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.authentication_config["2-0-control-plane-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "authentication_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
          [32m+[0m[0m "control_plane_id"      = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_plane_config["0-0-control-plane-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_plane_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "config"           = (sensitive value)
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_plane_config["1-0-control-plane-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_plane_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "config"           = (sensitive value)
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_plane_config["2-0-control-plane-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_plane_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "config"           = (sensitive value)
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_planes["0-0-control-plane-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_planes" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_planes["1-0-control-plane-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_planes" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_planes["2-0-control-plane-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_planes" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.first_control_plane[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "first_control_plane" {
      [32m+[0m[0m id = (known after apply)
    }

[1m  # module.kube-hetzner.null_resource.kustomization[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "kustomization" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "ccm_use_helm"     = "false"
          [32m+[0m[0m "helm_values_yaml" = (sensitive value)
          [32m+[0m[0m "options"          = <<-EOT
                period=5m
                post-reboot-node-labels=kured=done
                pre-reboot-node-labels=kured=rebooting
                reboot-command=/usr/bin/systemctl reboot
                reboot-sentinel=/sentinel/reboot-required
            EOT
          [32m+[0m[0m "versions"         = <<-EOT
                v1.31
                N/A
                v1.32.0
                N/A
                N/A
                N/A
                N/A
                1.17.0
                N/A
                N/A
                N/A
                *
                *
                *
                *
                v0.14.2
            EOT
        }
    }

[1m  # module.kube-hetzner.random_password.k3s_token[0m will be created
[0m  [32m+[0m[0m resource "random_password" "k3s_token" {
      [32m+[0m[0m bcrypt_hash = (sensitive value)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 48
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (sensitive value)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = true
    }

[1m  # module.kube-hetzner.random_password.rancher_bootstrap[0][0m will be created
[0m  [32m+[0m[0m resource "random_password" "rancher_bootstrap" {
      [32m+[0m[0m bcrypt_hash = (sensitive value)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 48
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (sensitive value)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = true
    }

[1m  # module.kube-hetzner.ssh_sensitive_resource.kubeconfig[0m will be created
[0m  [32m+[0m[0m resource "ssh_sensitive_resource" "kubeconfig" {
      [32m+[0m[0m agent                              = (sensitive value)
      [32m+[0m[0m bastion_port                       = "22"
      [32m+[0m[0m commands                           = [
          [32m+[0m[0m "cat /etc/rancher/k3s/k3s.yaml",
        ]
      [32m+[0m[0m commands_after_file_changes        = true
      [32m+[0m[0m host                               = (known after apply)
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m ignore_no_supported_methods_remain = false
      [32m+[0m[0m port                               = "22"
      [32m+[0m[0m private_key                        = (sensitive value)
      [32m+[0m[0m result                             = (sensitive value)
      [32m+[0m[0m retry_delay                        = "10s"
      [32m+[0m[0m timeout                            = "15m"
      [32m+[0m[0m user                               = "root"
      [32m+[0m[0m when                               = "create"
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].data.cloudinit_config.config[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = (known after apply)
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].hcloud_rdns.server[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].hcloud_rdns.server_ipv6[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server_ipv6" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "311967250"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
          [32m+[0m[0m "role"        = "agent_node"
        }
      [32m+[0m[0m location                   = "hel1"
      [32m+[0m[0m name                       = (known after apply)
      [32m+[0m[0m placement_group_id         = (known after apply)
      [32m+[0m[0m primary_disk_size          = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cx22"
      [32m+[0m[0m shutdown_before_deletion   = false
      [32m+[0m[0m ssh_keys                   = (known after apply)
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = (known after apply)

      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.0.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = (known after apply)
        }

      [32m+[0m[0m public_net {
          [32m+[0m[0m ipv4         = (known after apply)
          [32m+[0m[0m ipv4_enabled = true
          [32m+[0m[0m ipv6         = (known after apply)
          [32m+[0m[0m ipv6_enabled = true
        }
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].null_resource.os_upgrade_toggle[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "os_upgrade_toggle" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "os_upgrade_state" = "enabled"
          [32m+[0m[0m "server_id"        = (known after apply)
        }
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].random_string.identity_file[0m will be created
[0m  [32m+[0m[0m resource "random_string" "identity_file" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 20
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].random_string.server[0m will be created
[0m  [32m+[0m[0m resource "random_string" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m keepers     = {
          [32m+[0m[0m "name" = "kube-baphomet-worker-0"
        }
      [32m+[0m[0m length      = 3
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = false
      [32m+[0m[0m numeric     = false
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].data.cloudinit_config.config[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = (known after apply)
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].hcloud_rdns.server[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].hcloud_rdns.server_ipv6[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server_ipv6" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].hcloud_server.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "311967250"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
          [32m+[0m[0m "role"        = "agent_node"
        }
      [32m+[0m[0m location                   = "nbg1"
      [32m+[0m[0m name                       = (known after apply)
      [32m+[0m[0m placement_group_id         = (known after apply)
      [32m+[0m[0m primary_disk_size          = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cx32"
      [32m+[0m[0m shutdown_before_deletion   = false
      [32m+[0m[0m ssh_keys                   = (known after apply)
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = (known after apply)

      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.1.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = (known after apply)
        }

      [32m+[0m[0m public_net {
          [32m+[0m[0m ipv4         = (known after apply)
          [32m+[0m[0m ipv4_enabled = true
          [32m+[0m[0m ipv6         = (known after apply)
          [32m+[0m[0m ipv6_enabled = true
        }
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].null_resource.os_upgrade_toggle[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "os_upgrade_toggle" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "os_upgrade_state" = "enabled"
          [32m+[0m[0m "server_id"        = (known after apply)
        }
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].random_string.identity_file[0m will be created
[0m  [32m+[0m[0m resource "random_string" "identity_file" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 20
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].random_string.server[0m will be created
[0m  [32m+[0m[0m resource "random_string" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m keepers     = {
          [32m+[0m[0m "name" = "kube-baphomet-worker-1"
        }
      [32m+[0m[0m length      = 3
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = false
      [32m+[0m[0m numeric     = false
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].data.cloudinit_config.config[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = (known after apply)
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].hcloud_rdns.server[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].hcloud_rdns.server_ipv6[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server_ipv6" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "311967250"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
          [32m+[0m[0m "role"        = "agent_node"
        }
      [32m+[0m[0m location                   = "fsn1"
      [32m+[0m[0m name                       = (known after apply)
      [32m+[0m[0m placement_group_id         = (known after apply)
      [32m+[0m[0m primary_disk_size          = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cx32"
      [32m+[0m[0m shutdown_before_deletion   = false
      [32m+[0m[0m ssh_keys                   = (known after apply)
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = (known after apply)

      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.2.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = (known after apply)
        }

      [32m+[0m[0m public_net {
          [32m+[0m[0m ipv4         = (known after apply)
          [32m+[0m[0m ipv4_enabled = true
          [32m+[0m[0m ipv6         = (known after apply)
          [32m+[0m[0m ipv6_enabled = true
        }
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].null_resource.os_upgrade_toggle[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "os_upgrade_toggle" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "os_upgrade_state" = "enabled"
          [32m+[0m[0m "server_id"        = (known after apply)
        }
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].random_string.identity_file[0m will be created
[0m  [32m+[0m[0m resource "random_string" "identity_file" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 20
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].random_string.server[0m will be created
[0m  [32m+[0m[0m resource "random_string" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m keepers     = {
          [32m+[0m[0m "name" = "kube-baphomet-worker-2"
        }
      [32m+[0m[0m length      = 3
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = false
      [32m+[0m[0m numeric     = false
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].data.cloudinit_config.config[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = (known after apply)
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_rdns.server[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_rdns.server_ipv6[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server_ipv6" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_server.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "311967250"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
          [32m+[0m[0m "role"        = "control_plane_node"
        }
      [32m+[0m[0m location                   = "fsn1"
      [32m+[0m[0m name                       = (known after apply)
      [32m+[0m[0m placement_group_id         = (known after apply)
      [32m+[0m[0m primary_disk_size          = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cx22"
      [32m+[0m[0m shutdown_before_deletion   = false
      [32m+[0m[0m ssh_keys                   = (known after apply)
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = (known after apply)

      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.255.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = (known after apply)
        }

      [32m+[0m[0m public_net {
          [32m+[0m[0m ipv4         = (known after apply)
          [32m+[0m[0m ipv4_enabled = true
          [32m+[0m[0m ipv6         = (known after apply)
          [32m+[0m[0m ipv6_enabled = true
        }
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.os_upgrade_toggle[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "os_upgrade_toggle" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "os_upgrade_state" = "enabled"
          [32m+[0m[0m "server_id"        = (known after apply)
        }
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.identity_file[0m will be created
[0m  [32m+[0m[0m resource "random_string" "identity_file" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 20
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.server[0m will be created
[0m  [32m+[0m[0m resource "random_string" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m keepers     = {
          [32m+[0m[0m "name" = "kube-baphomet-control-plane-0"
        }
      [32m+[0m[0m length      = 3
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = false
      [32m+[0m[0m numeric     = false
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].data.cloudinit_config.config[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = <<-EOT
                #cloud-config
                
                write_files:
                
                # Script to rename the private interface to eth1 and unify NetworkManager connection naming
                - path: /etc/cloud/rename_interface.sh
                  content: |
                    #!/bin/bash
                    set -euo pipefail
                
                    sleep 11
                
                    # Somehow sometimes on private-ip only setups, the 
                    # interface may already be correctly names, and this
                    # block should be skipped.
                    if ! ip link show eth1; then
                      # Take row beginning with 3 if exists, 2 otherwise (if only a private ip)
                      INTERFACE=$(ip link show | grep -v 'flannel' | awk 'BEGIN{l3=""}; /^3:/{l3=$2}; /^2:/{l2=$2}; END{if(l3!="") print l3; else print l2}' | sed 's/://g')
                      MAC=$(cat /sys/class/net/$INTERFACE/address)
                
                      if [ "$INTERFACE" = "eth1" ]; then
                        echo "Interface $INTERFACE already points to $MAC, skipping..."
                        exit 0
                      fi
                
                      # Take row beginning with 3 if exists, 2 otherwise (if only a private ip)
                      # WV REMOVE > INTERFACE=$(ip link show | awk 'BEGIN{l3=""}; /^3:/{l3=$2}; /^2:/{l2=$2}; END{if(l3!="") print l3; else print l2}' | sed 's/://g')
                      # WV REMOVE > MAC=$(cat /sys/class/net/$INTERFACE/address)
                
                      cat <<EOF > /etc/udev/rules.d/70-persistent-net.rules
                      SUBSYSTEM=="net", ACTION=="add", DRIVERS=="?*", ATTR{address}=="$MAC", NAME="eth1"
                    EOF
                
                      ip link set $INTERFACE down
                      ip link set $INTERFACE name eth1
                      ip link set eth1 up
                    fi
                
                    myrepeat () {
                        # Current time + 300 seconds (5 minutes)
                        local END_SECONDS=$((SECONDS + 300))
                        while true; do
                            >&2 echo "loop"
                            if (( "$SECONDS" > "$END_SECONDS" )); then
                                >&2 echo "timeout reached"
                                exit 1
                            fi
                            # run command and check return code
                            if $@ ; then
                                >&2 echo "break"
                                break
                            else
                                >&2 echo "got failure exit code, repeating"
                                sleep 0.5
                            fi
                        done
                    }
                
                    myrename () {
                        local eth="$1"
                        local eth_connection
                
                        # In case of a private-only network, eth0 may not exist
                        if ip link show "$eth" &>/dev/null; then
                            eth_connection=$(nmcli -g GENERAL.CONNECTION device show "$eth" || echo '')
                            nmcli connection modify "$eth_connection" \
                              con-name "$eth" \
                              connection.interface-name "$eth"
                        fi
                    }
                
                    myrepeat myrename eth0
                    myrepeat myrename eth1
                
                    systemctl restart NetworkManager
                  permissions: "0744"
                
                # Disable ssh password authentication
                - content: |
                    Port 22
                    PasswordAuthentication no
                    X11Forwarding no
                    MaxAuthTries 2
                    AllowTcpForwarding no
                    AllowAgentForwarding no
                    AuthorizedKeysFile .ssh/authorized_keys
                  path: /etc/ssh/sshd_config.d/kube-hetzner.conf
                
                # Set reboot method as "kured"
                - content: |
                    REBOOT_METHOD=kured
                  path: /etc/transactional-update.conf
                
                # Create Rancher repo config
                - content: |
                    [rancher-k3s-common-stable]
                    name=Rancher K3s Common (stable)
                    baseurl=https://rpm.rancher.io/k3s/stable/common/microos/noarch
                    enabled=1
                    gpgcheck=1
                    repo_gpgcheck=0
                    gpgkey=https://rpm.rancher.io/public.key
                  path: /etc/zypp/repos.d/rancher-k3s-common.repo
                
                # Create the kube_hetzner_selinux.te file, that allows in SELinux to not interfere with various needed services
                - path: /root/kube_hetzner_selinux.te
                  content: |
                    module kube_hetzner_selinux 1.0;
                
                    require {
                        type kernel_t, bin_t, kernel_generic_helper_t, iscsid_t, iscsid_exec_t, var_run_t, var_lib_t,
                            init_t, unlabeled_t, systemd_logind_t, systemd_hostnamed_t, container_t,
                            cert_t, container_var_lib_t, etc_t, usr_t, container_file_t, container_log_t,
                            container_share_t, container_runtime_exec_t, container_runtime_t, var_log_t, proc_t, io_uring_t, fuse_device_t, http_port_t,
                            container_var_run_t;
                        class key { read view };
                        class file { open read execute execute_no_trans create link lock rename write append setattr unlink getattr watch };
                        class sock_file { watch write create unlink };
                        class unix_dgram_socket create;
                        class unix_stream_socket { connectto read write };
                        class dir { add_name create getattr link lock read rename remove_name reparent rmdir setattr unlink search write watch };
                        class lnk_file { read create };
                        class system module_request;
                        class filesystem associate;
                        class bpf map_create;
                        class io_uring sqpoll;
                        class anon_inode { create map read write };
                        class tcp_socket name_connect;
                        class chr_file { open read write };
                    }
                
                    #============= kernel_generic_helper_t ==============
                    allow kernel_generic_helper_t bin_t:file execute_no_trans;
                    allow kernel_generic_helper_t kernel_t:key { read view };
                    allow kernel_generic_helper_t self:unix_dgram_socket create;
                
                    #============= iscsid_t ==============
                    allow iscsid_t iscsid_exec_t:file execute;
                    allow iscsid_t var_run_t:sock_file write;
                    allow iscsid_t var_run_t:unix_stream_socket connectto;
                
                    #============= init_t ==============
                    allow init_t unlabeled_t:dir { add_name remove_name rmdir search };
                    allow init_t unlabeled_t:lnk_file create;
                    allow init_t container_t:file { open read };
                    allow init_t container_file_t:file { execute execute_no_trans };
                    allow init_t fuse_device_t:chr_file { open read write };
                    allow init_t http_port_t:tcp_socket name_connect;
                
                    #============= systemd_logind_t ==============
                    allow systemd_logind_t unlabeled_t:dir search;
                
                    #============= systemd_hostnamed_t ==============
                    allow systemd_hostnamed_t unlabeled_t:dir search;
                
                    #============= container_t ==============
                    allow container_t { cert_t container_log_t }:dir read;
                    allow container_t { cert_t container_log_t }:lnk_file read;
                    allow container_t cert_t:file { read open };
                    allow container_t container_var_lib_t:dir { add_name remove_name write read create };
                    allow container_t container_var_lib_t:file { append create open read write rename lock setattr getattr unlink };
                    allow container_t etc_t:dir { add_name remove_name write create setattr watch };
                    allow container_t etc_t:file { create setattr unlink write };
                    allow container_t etc_t:sock_file { create unlink };
                    allow container_t usr_t:dir { add_name create getattr link lock read rename remove_name reparent rmdir setattr unlink search write };
                    allow container_t usr_t:file { append create execute getattr link lock read rename setattr unlink write };
                    allow container_t container_file_t:file { open read write append getattr setattr lock };
                    allow container_t container_file_t:sock_file watch;
                    allow container_t container_log_t:file { open read write append getattr setattr watch };
                    allow container_t container_share_t:dir { read write add_name remove_name };
                    allow container_t container_share_t:file { read write create unlink };
                    allow container_t container_runtime_exec_t:file { read execute execute_no_trans open };
                    allow container_t container_runtime_t:unix_stream_socket { connectto read write };
                    allow container_t kernel_t:system module_request;
                    allow container_t var_log_t:dir { add_name write remove_name watch read };
                    allow container_t var_log_t:file { create lock open read setattr write unlink getattr };
                    allow container_t var_lib_t:dir { add_name remove_name write read create };
                    allow container_t var_lib_t:file { append create open read write rename lock setattr getattr unlink };
                    allow container_t proc_t:filesystem associate;
                    allow container_t self:bpf map_create;
                    allow container_t self:io_uring sqpoll;
                    allow container_t io_uring_t:anon_inode { create map read write };
                    allow container_t container_var_run_t:dir { add_name remove_name write };
                    allow container_t container_var_run_t:file { create open read rename unlink write };
                
                # Create the k3s registries file if needed
                
                # Create k3s registries file
                - content: IA==
                  encoding: base64
                  path: /etc/rancher/k3s/registries.yaml
                
                
                
                # Apply DNS config
                manage_resolv_conf: true
                resolv_conf:
                  nameservers:
                    - 8.8.8.8
                    - 2606:4700:4700::1111
                
                # Add ssh authorized keys
                ssh_authorized_keys:
                  - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDM6+/y/tv38oxmx8PPUPCljLm5o/Q8ROFOtddjwGaZq sandro@sandros-MBP.telekom.ip
                  - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIBYt98G/lAhpNxBLY1JAGZcHSbMTuBJHwFFwMTkt/my sandro@sandros-MacBook-Pro.local
                  - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKC6jxq2Lbiwe4cjcB8itTmh4a6ldDR6KVGSM2PvrZwb sandro@DESKTOP-E6TGITL
                
                # Resize /var, not /, as that's the last partition in MicroOS image.
                growpart:
                    devices: ["/var"]
                
                # Make sure the hostname is set correctly
                hostname: kube-baphomet-control-plane-1-sqi
                preserve_hostname: true
                
                runcmd:
                
                # ensure that /var uses full available disk size, thanks to btrfs this is easy
                - [btrfs, 'filesystem', 'resize', 'max', '/var']
                
                # SELinux permission for the SSH alternative port
                
                
                # Create and apply the necessary SELinux module for kube-hetzner
                - [checkmodule, '-M', '-m', '-o', '/root/kube_hetzner_selinux.mod', '/root/kube_hetzner_selinux.te']
                - ['semodule_package', '-o', '/root/kube_hetzner_selinux.pp', '-m', '/root/kube_hetzner_selinux.mod']
                - [semodule, '-i', '/root/kube_hetzner_selinux.pp']
                - [setsebool, '-P', 'virt_use_samba', '1']
                - [setsebool, '-P', 'domain_kernel_load_modules', '1']
                
                # Disable rebootmgr service as we use kured instead
                - [systemctl, disable, '--now', 'rebootmgr.service']
                
                # Bounds the amount of logs that can survive on the system
                - [sed, '-i', 's/#SystemMaxUse=/SystemMaxUse=3G/g', /etc/systemd/journald.conf]
                - [sed, '-i', 's/#MaxRetentionSec=/MaxRetentionSec=1week/g', /etc/systemd/journald.conf]
                
                # Reduces the default number of snapshots from 2-10 number limit, to 4 and from 4-10 number limit important, to 2
                - [sed, '-i', 's/NUMBER_LIMIT="2-10"/NUMBER_LIMIT="4"/g', /etc/snapper/configs/root]
                - [sed, '-i', 's/NUMBER_LIMIT_IMPORTANT="4-10"/NUMBER_LIMIT_IMPORTANT="3"/g', /etc/snapper/configs/root]
                
                # Allow network interface
                - [chmod, '+x', '/etc/cloud/rename_interface.sh']
                
                # Restart the sshd service to apply the new config
                - [systemctl, 'restart', 'sshd']
                
                # Make sure the network is up
                - [systemctl, restart, NetworkManager]
                - [systemctl, status, NetworkManager]
                
                # Cleanup some logs
                - [truncate, '-s', '0', '/var/log/audit/audit.log']
                
                # Add logic to truly disable SELinux if disable_selinux = true.
                # We'll do it by appending to cloudinit_runcmd_common.
                
                
                
                
                # Configure default routes based on public ip availability
                # Standard setup: eth0 is public, configure both IPv4 and IPv6
                - [ip, route, add, default, via, '172.31.1.1', dev, 'eth0', metric, '100']
                - [ip, -6, route, add, default, via, 'fe80::1', dev, 'eth0', metric, '100']
            EOT
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_rdns.server[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server" {
      [32m+[0m[0m dns_ptr    = "kube-baphomet-control-plane-1-sqi.baphomet.cloud"
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_rdns.server_ipv6[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server_ipv6" {
      [32m+[0m[0m dns_ptr    = "kube-baphomet-control-plane-1-sqi.baphomet.cloud"
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_server.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "311967250"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
          [32m+[0m[0m "role"        = "control_plane_node"
        }
      [32m+[0m[0m location                   = "nbg1"
      [32m+[0m[0m name                       = "kube-baphomet-control-plane-1-sqi"
      [32m+[0m[0m placement_group_id         = (known after apply)
      [32m+[0m[0m primary_disk_size          = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cx22"
      [32m+[0m[0m shutdown_before_deletion   = false
      [32m+[0m[0m ssh_keys                   = (known after apply)
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = (known after apply)

      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.254.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = (known after apply)
        }

      [32m+[0m[0m public_net {
          [32m+[0m[0m ipv4         = (known after apply)
          [32m+[0m[0m ipv4_enabled = true
          [32m+[0m[0m ipv6         = (known after apply)
          [32m+[0m[0m ipv6_enabled = true
        }
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.os_upgrade_toggle[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "os_upgrade_toggle" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "os_upgrade_state" = "enabled"
          [32m+[0m[0m "server_id"        = (known after apply)
        }
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].data.cloudinit_config.config[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = (known after apply)
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_rdns.server[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_rdns.server_ipv6[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server_ipv6" {
      [32m+[0m[0m dns_ptr    = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_server.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "311967250"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
          [32m+[0m[0m "role"        = "control_plane_node"
        }
      [32m+[0m[0m location                   = "hel1"
      [32m+[0m[0m name                       = (known after apply)
      [32m+[0m[0m placement_group_id         = (known after apply)
      [32m+[0m[0m primary_disk_size          = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cx22"
      [32m+[0m[0m shutdown_before_deletion   = false
      [32m+[0m[0m ssh_keys                   = (known after apply)
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = (known after apply)

      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.253.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = (known after apply)
        }

      [32m+[0m[0m public_net {
          [32m+[0m[0m ipv4         = (known after apply)
          [32m+[0m[0m ipv4_enabled = true
          [32m+[0m[0m ipv6         = (known after apply)
          [32m+[0m[0m ipv6_enabled = true
        }
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.os_upgrade_toggle[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "os_upgrade_toggle" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "os_upgrade_state" = "enabled"
          [32m+[0m[0m "server_id"        = (known after apply)
        }
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.identity_file[0m will be created
[0m  [32m+[0m[0m resource "random_string" "identity_file" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 20
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.server[0m will be created
[0m  [32m+[0m[0m resource "random_string" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m keepers     = {
          [32m+[0m[0m "name" = "kube-baphomet-control-plane-2"
        }
      [32m+[0m[0m length      = 3
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = false
      [32m+[0m[0m numeric     = false
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1mPlan:[0m 88 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Pushed by @muchasxmaracas, Action: `pull_request`*